import re

def finalize_text(text, target_lang):
    if not text: return ""
    
    latin_to_cyr = {
        "sh":"ш","Sh":"Ш","ch":"ч","Ch":"Ч","o'":"ў","O'":"Ў","g'":"ғ","G'":"Ғ",
        "a":"а","b":"б","d":"д","e":"е","f":"ф","g":"г","h":"ҳ","i":"и","j":"ж",
        "k":"к","l":"л","m":"м","n":"н","o":"о","p":"п","q":"қ","r":"р","s":"с",
        "t":"т","u":"у","v":"в","x":"х","y":"й","z":"з","A":"А","B":"Б","D":"Д",
        "E":"Е","F":"Ф","G":"Г","H":"Ҳ","I":"И","J":"Ж","K":"К","L":"Л","M":"М",
        "N":"Н","O":"О","P":"П","Q":"Қ","R":"Р","S":"С","T":"Т","U":"У","V":"В","X":"Х","Y":"Й","Z":"З"
    }
    
    cyr_to_lat = {
        "ш":"sh","Ш":"Sh","ч":"ch","Ч":"Ch","ў":"o'","Ў":"O'","ғ":"g'","Ғ":"G'",
        "а":"a","б":"b","д":"d","е":"e","ф":"f","г":"g","ҳ":"h","и":"i","ж":"j",
        "к":"k","л":"l","м":"m","н":"n","о":"o","п":"p","қ":"q","р":"r","с":"s",
        "т":"t","у":"u","в":"v","х":"x","й":"y","з":"z","А":"A","Б":"B","Д":"D",
        "Е":"E","Ф":"F":"Г":"G","Ҳ":"H","И":"I","Ж":"J","К":"K","Л":"L","М":"M",
        "Н":"N","О":"O","П":"P","Қ":"Q","Р":"R","С":"S","Т":"T","У":"U","В":"V","Х":"X","Й":"Y","З":"Z"
    }

    if target_lang == "cyrillic":
        # Lotindan Kirillga
        for k, v in latin_to_cyr.items():
            text = text.replace(k, v)
    else:
        # Kirilldan Lotinga
        for k, v in cyr_to_lat.items():
            text = text.replace(k, v)
    return text
